# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [3]:
#Your code here
c.execute("""SELECT firstName, lastName FROM employees 
                JOIN offices USING(officeCode)
                WHERE city IS 'Boston'""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
#Your code here
c.execute("""SELECT COUNT(employeeNumber) FROM offices
                LEFT JOIN employees USING(officeCode)
                GROUP BY officeCode""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   COUNT(employeeNumber)
0                      6
1                      2
2                      2
3                      5
4                      2
5                      4
6                      2

## Write 3 Questions of your own and answer them

In [5]:
# Answers will vary
# 1. how many customers does each office serve?

In [6]:
# Your code here
c.execute("""SELECT officeCode, o.city, COUNT(customerNumber) as customers FROM offices o
                JOIN employees e USING(officeCode)
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                GROUP BY officeCode""")

df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  officeCode           city  customers
0          1  San Francisco         12
1          2         Boston         12
2          3            NYC         15
3          4          Paris         29
4          5          Tokyo          5
5          6         Sydney         10
6          7         London         17

In [7]:
# Your code here

In [8]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [11]:
# Your code here
# join employees with customers, orders, orderdetails, and products
c.execute("""SELECT e.firstName, e.lastName, p.productName FROM employees e
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o ON c.customerNumber = o.customerNumber
                JOIN orderdetails od ON o.orderNumber = od.orderNumber
                JOIN products p ON od.productCode = p.productCode""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

     firstName  lastName                                  productName
0       Leslie  Jennings                               1958 Setra Bus
1       Leslie  Jennings                       1940 Ford Pickup Truck
2       Leslie  Jennings                      1939 Cadillac Limousine
3       Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4       Leslie  Jennings                            1968 Ford Mustang
5       Leslie  Jennings                           1968 Dodge Charger
6       Leslie  Jennings                      1970 Plymouth Hemi Cuda
7       Leslie  Jennings                           1969 Dodge Charger
8       Leslie  Jennings                  1948 Porsche 356-A Roadster
9       Leslie  Jennings                         1969 Dodge Super Bee
10      Leslie  Jennings                        1976 Ford Gran Torino
11      Leslie  Jennings                             1957 Vespa GS150
12      Leslie  Jennings                    1957 Corvette Convertible
13      Leslie  Jennings                      1982 Ducati 900 Monster
14      Leslie  Jennings                      1982 Lamborghini Diablo
15      Leslie  Jennings                    1971 Alpine Renault 1600s
16      Leslie  Jennings                      1956 Porsche 356A Coupe
17      Leslie  Jennings                        1961 Chevrolet Impala
18      Leslie  Jennings                            1982 Ducati 996 R
19      Leslie  Jennings                    1974 Ducati 350 Mk3 Desmo
20      Leslie  Jennings                           2002 Yamaha YZR M1
21      Leslie  Jennings                            2001 Ferrari Enzo
22      Leslie  Jennings                           1969 Corvair Monza
23      Leslie  Jennings                             1969 Ford Falcon
24      Leslie  Jennings                            1903 Ford Model A
25      Leslie  Jennings                     Collectable Wooden Train
26      Leslie  Jennings                        1970 Triumph Spitfire
27      Leslie  Jennings                          1904 Buick Runabout
28      Leslie  Jennings                        18th century schooner
29      Leslie  Jennings             1912 Ford Model T Delivery Wagon
...        ...       ...                                          ...
2966    Martin    Gerard                     1917 Grand Touring Sedan
2967    Martin    Gerard                           1911 Ford Town Car
2968    Martin    Gerard                    1932 Model A Ford J-Coupe
2969    Martin    Gerard                       1928 Mercedes-Benz SSK
2970    Martin    Gerard                  1939 Chevrolet Deluxe Coupe
2971    Martin    Gerard    1938 Cadillac V-16 Presidential Limousine
2972    Martin    Gerard             1936 Mercedes Benz 500k Roadster
2973    Martin    Gerard                            2001 Ferrari Enzo
2974    Martin    Gerard                           1969 Corvair Monza
2975    Martin    Gerard                      1939 Cadillac Limousine
2976    Martin    Gerard                     1962 Volkswagen Microbus
2977    Martin    Gerard                        1936 Chrysler Airflow
2978    Martin    Gerard                  1980’s GM Manhattan Express
2979    Martin    Gerard  1996 Peterbilt 379 Stake Bed with Outrigger
2980    Martin    Gerard                              1982 Camaro Z28
2981    Martin    Gerard                            1957 Chevy Pickup
2982    Martin    Gerard               1998 Chrysler Plymouth Prowler
2983    Martin    Gerard                       1964 Mercedes Tour Bus
2984    Martin    Gerard                        1926 Ford Fire Engine
2985    Martin    Gerard                  1992 Ferrari 360 Spider red
2986    Martin    Gerard                           1970 Dodge Coronet
2987    Martin    Gerard                     1962 Volkswagen Microbus
2988    Martin    Gerard          1958 Chevy Corvette Limited Edition
2989    Martin    Gerard            1992 Porsche Cayenne Turbo Silver
2990    Martin    Gerard                  1980’s GM Manhattan Express
2991    Martin    Gerard                  1954 Greyhound Scenicruiser
2992    Martin    Gerard       1950's Chicago Surface Lines Streetcar
2993    Martin    Gerard             Diamond T620 Semi-Skirted Tanker
2994    Martin    Gerard                           1911 Ford Town Car
2995    Martin    Gerard             1936 Mercedes Benz 500k Roadster

[2996 rows x 3 columns]

## Level Up: Display the Number of Products each employee has sold

In [13]:
#Your code here
c.execute("""SELECT e.firstName, e.lastName, COUNT(p.productCode) as productsSold FROM employees e
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o ON c.customerNumber = o.customerNumber
                JOIN orderdetails od ON o.orderNumber = od.orderNumber
                JOIN products p ON od.productCode = p.productCode
                GROUP BY employeeNumber
                ORDER BY firstName, lastName""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   firstName   lastName  productsSold
0       Andy     Fixter           185
1      Barry      Jones           220
2   Foon Yue      Tseng           142
3     George     Vanauf           211
4     Gerard  Hernandez           396
5      Julie   Firrelli           124
6      Larry       Bott           236
7     Leslie   Jennings           331
8     Leslie   Thompson           114
9       Loui     Bondur           177
10      Mami      Nishi           137
11    Martin     Gerard           114
12    Pamela   Castillo           272
13     Peter      Marsh           185
14     Steve  Patterson           152

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!